app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-06 22:53:44.882501"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    byebug
    @article.update(title: params[:article][:title], description: params[:article][:description])